In [1]:
# import necessary libraries
import numpy as np
import pandas as pd
from numpy import nan as NA

In [2]:
# create a DataFrame object
df = pd.DataFrame(np.arange(4*4).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'New York', 'Colorado'],
                    columns=['one', 'two', 'three', 'four'])
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11
Colorado   12   13     14    15

In [3]:
# select the first two columns, 'one' and 'two'
df[['one','two']]

          one  two
Ohio        0    1
Colorado    4    5
New York    8    9
Colorado   12   13

In [4]:
# select rows that values in column 'two' is > 5
df[df.two>5]

          one  two  three  four
New York    8    9     10    11
Colorado   12   13     14    15

In [5]:
# re-create the DataFrame object
df = pd.DataFrame(np.arange(4*4).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'New York', 'Colorado'],
                    columns=['one', 'two', 'three', 'four'])
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11
Colorado   12   13     14    15

In [6]:
# add a new column called 'average' that has the average values of four columns
df['average'] = df.mean(1)
df

          one  two  three  four  average
Ohio        0    1      2     3      1.5
Colorado    4    5      6     7      5.5
New York    8    9     10    11      9.5
Colorado   12   13     14    15     13.5

In [7]:
# re-create the DataFrame object
df = pd.DataFrame(np.arange(4*4).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'New York', 'Colorado'],
                    columns=['one', 'two', 'three', 'four'])

In [8]:
# do something to change the order of columns to "four", "one", "three", "two"
df = df[["four", "one", "three", "two"]]
print(df)

          four  one  three  two
Ohio         3    0      2    1
Colorado     7    4      6    5
New York    11    8     10    9
Colorado    15   12     14   13

In [9]:
# set values above 10 to NaN, i.e., set 11, 12, 13, 14, 15 all to NaN
df[df>=10] = NA
print(df)

          four  one  three  two
Ohio       3.0  0.0    2.0  1.0
Colorado   7.0  4.0    6.0  5.0
New York   NaN  8.0    NaN  9.0
Colorado   NaN  NaN    NaN  NaN

In [10]:
# drop any row has more than two NaN values
df=df.dropna(thresh=2)
print(df)

          four  one  three  two
Ohio       3.0  0.0    2.0  1.0
Colorado   7.0  4.0    6.0  5.0
New York   NaN  8.0    NaN  9.0